# Third-party repositories
tap "hacker1024/hacker1024"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hpedrorodrigues/tools"
tap "spicetify/tap"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Reimplementation of ctags(1)
brew "ctags"

# Command-line DNS client
brew "dog"

# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"

# More intuitive version of du in rust
brew "dust"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Collection of GNU find, xargs, and locate
brew "findutils"

# Command-line fuzzy finder written in Go
brew "fzf"

# GitHub command-line tool
brew "gh"

# Access GitHub's .gitignore boilerplates
brew "gibo"

# Distributed revision control system
brew "git"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Git extension for versioning large files
brew "git-lfs"

# GNU implementation of the famous stream editor
brew "gnu-sed"

# GNU version of the tar archiving utility
brew "gnu-tar"

# GNU implementation of which utility
brew "gnu-which"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Ping, but with a graph
brew "gping"

# GNU grep, egrep and fgrep
brew "grep"

# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Portable library for network traffic capture
brew "libpcap"

# Clone of ls with colorful output, file type icons, and more
brew "lsd"

# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"

# Mac App Store command-line interface
brew "mas"

# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Port scanning utility for large networks
brew "nmap"

# Platform built on V8 to build network applications
brew "node"

# Manage multiple Node.js versions
brew "nvm"

# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"

# Execute binaries from Python packages in isolated environments
brew "pipx"

# Cross-platform library for audio I/O
brew "portaudio"

# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Rust toolchain installer
brew "rustup-init"

# Utility that provides fast incremental file transfer
brew "rsync"

# Intuitive find & replace CLI
brew "sd"

# Terminal-based client for Spotify
brew "spotify-tui"

# Spotify daemon
brew "spotifyd", restart_service: true

# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"

# Cross-shell prompt for astronauts
brew "starship"

# Very fast implementation of tldr in Rust
brew "tealdeer"

# User interface to the TELNET protocol
brew "telnet"

# Terminal multiplexer
brew "tmux"

# Generator for LS_COLORS with support for multiple color themes
brew "vivid"

# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"

# JavaScript package manager
brew "yarn"

# Outputs current CPU core and package temperatures on macOS
brew "hacker1024/hacker1024/coretemp"

# Command-line tool to customize Spotify client
brew "spicetify/tap/spicetify-cli"

# Automatic tiling window manager similar to xmonad
cask "amethyst"

# Memory training application
cask "anki"

# App to build and share containerized applications and microservices
cask "docker"

# Command-line utility for managing macOS dock item
cask "dockutil"

# Dark theme for the native Color Picker
cask "dracula-macos-color-picker"

# Monospaced font with programming ligatures
cask "font-fira-code-nerd-font"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

# Keyboard customizer
cask "karabiner-elements"

# Software for Logitech devices
cask "logi-options-plus"

# Provides access to camera controls
cask "logitech-camera-settings"

# Tool to control external monitor brightness & volume
cask "monitorcontrol"

# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

# Control your tools with a few keystrokes
cask "raycast"

# Tool to reverse the direction of scrolling
cask "scroll-reverser"

# Music streaming service
cask "spotify"

# Open-source BitTorrent client
cask "transmission"

# Privacy extension for browser
mas "AdBlock Pro", id: 1018301773

# Password Manager
mas "Bitwarden", id: 1352778147

# Remix the Web
mas "Cascadea", id: 1432182561

# For Netflix, HBO Max, Amazon Prime etc.
mas "Friendly Streaming Browser", id: 553245401

# Better To-Do List
mas "Lunatask: A Better To-Do List", id: 1583719331

# Dark Mode for Safari
mas "Noir", id: 1592917505

# Keyboard Shortcuts extension for Safari
mas "Vimari", id: 1480933944
