# Third-party repositories
tap "cormacrelf/tap"
tap "felixkratz/formulae"
tap "hacker1024/hacker1024"
tap "hpedrorodrigues/tools"
tap "koekeishiya/formulae"
tap "zero-sh/tap"

# AI pair programming in your terminal
brew "aider"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Reimplementation of ctags(1)
brew "ctags"

# Tool for managing dock items
brew "dockutil"

# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"

# More intuitive version of du in rust
brew "dust"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Collection of GNU find, xargs, and locate
brew "findutils"

# Command-line fuzzy finder written in Go
brew "fzf"

# GitHub command-line tool
brew "gh"

# Interpreter for PostScript and PDF
brew "ghostscript"

# Access GitHub's .gitignore boilerplates
brew "gibo"

# Distributed revision control system
brew "git"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Git extension for versioning large files
brew "git-lfs"

# GNU implementation of the famous stream editor
brew "gnu-sed"

# GNU version of the tar archiving utility
brew "gnu-tar"

# GNU implementation of which utility
brew "gnu-which"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Ping, but with a graph
brew "gping"

# Colorize logfiles and command output
brew "grc"

# GNU grep, egrep and fgrep
brew "grep"

# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Simple terminal UI for git commands
brew "lazygit"

# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"

# Portable library for network traffic capture
brew "libpcap"

# Next-gen compiler infrastructure
brew "llvm"

# Clone of ls with colorful output, file type icons, and more
brew "lsd"

# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"

# Mac App Store command-line interface
brew "mas"

# Polyglot runtime manager (asdf rust clone)
brew "mise"

# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"

# Text-based UI library
brew "ncurses"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Port scanning utility for large networks
brew "nmap"

# Platform built on V8 to build network applications
brew "node"

# Manage multiple Node.js versions
brew "nvm"

# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"

# Execute binaries from Python packages in isolated environments
brew "pipx"

# Cross-platform library for audio I/O
brew "portaudio"

# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Utility that provides fast incremental file transfer
brew "rsync"

# Rust toolchain installer
brew "rustup"

# Intuitive find & replace CLI
brew "sd"

# Command-line tool to customize Spotify client
brew "spicetify-cli"

# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"

# Cross-shell prompt for astronauts
brew "starship"

# Formatting tool for reformatting Swift code
brew "swiftformat"

# Very fast implementation of tldr in Rust
brew "tealdeer"

# User interface to the TELNET protocol
brew "telnet"

# Terminal multiplexer
brew "tmux"

# Generator for LS_COLORS with support for multiple color themes
brew "vivid"

# Internet file retriever
brew "wget"

# Little beautifier tool for xcodebuild
brew "xcbeautify"

# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"

# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"

# JavaScript package manager
brew "yarn"

# Outputs current CPU core and package temperatures on macOS
brew "hacker1024/hacker1024/coretemp"

# Command-line tool to customize Spotify client
brew "spicetify/tap/spicetify-cli"

# Automatic tiling window manager similar to xmonad
cask "amethyst"

# Memory training application
cask "anki"

# E-books management software
cask "calibre"

# Client for the Dropbox cloud storage service
cask "dropbox"

# Monospaced font with programming ligatures
cask "font-fira-code-nerd-font"

# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"

# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"

# Free and open-source media player
cask "iina"

# Keyboard customiser
cask "karabiner-elements"

# Software for Logitech devices
cask "logi-options+"

# Provides access to camera controls
cask "logitech-camera-settings"

# Encrypted to-do list, habit tracker, journaling, life-tracking and notes app
cask "lunatask"

# Tool to control external monitor brightness & volume
cask "monitorcontrol"

# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

# Replacement for Docker Desktop
cask "orbstack"

# Control your tools with a few keystrokes
cask "raycast"

# Open-source BitTorrent client
cask "transmission"

# Email client
cask "tuta-mail"

# Multiplayer code editor
cask "zed"

# Remix the Web
mas "Cascadea", id: 1432182561

# Photo & video
mas "DaVinci Resolve", id: 571213070

# Movie maker & time lapse clips
mas "GoPro Quik", id: 561350520

# Block cookies and tracking nags
mas "Hush", id: 1544743900

# Personal accounting software
mas "MoneyWiz", id: 1511185140

# News reader
mas "Reeder", id: 1529448980

# Block ads, trackers, and more
mas "Wipr", id: 1662217862

# VPN client
mas "WireGuard", id: 1451685025

# Keyboard Shortcuts extension for Safari
mas "Vimari", id: 1480933944
